
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2023.2.307
# Date: 2024-01-14 20:17

# Copyright (C) 2013 - 2023 Efinix Inc. All rights reserved.

# Device: Ti180M484
# Project: REPEATER
# Timing Model: C4 (final)

# PLL Constraints
#################
create_clock -period 8.0000 PLL_RCLK_0
create_clock -waveform {2.0000 6.0000} -period 8.0000 PLL_RCLK_0_90
create_clock -period 8.0000 PLL_RCLK_1
create_clock -waveform {2.0000 6.0000} -period 8.0000 PLL_RCLK_1_90

# GPIO Constraints
####################
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {MDC_1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {MDC_1}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {MDIOI_1}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {MDIOI_1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {MDIOO_1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {MDIOO_1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {MDIOE_1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {MDIOE_1}]

# JTAG Constraints
####################
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_TCK}]
set_output_delay -clock jtag_inst1_TCK -max 0.117 [get_ports {jtag_inst1_TDO}]
set_output_delay -clock jtag_inst1_TCK -min -0.075 [get_ports {jtag_inst1_TDO}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.243 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.162 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.337 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.225 [get_ports {jtag_inst1_SHIFT}]
# JTAG Constraints (extra... not used by current Efinity debug tools)
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_DRCK}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.280 [get_ports {jtag_inst1_RUNTEST}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.187 [get_ports {jtag_inst1_RUNTEST}]
# Create separate clock groups for JTAG clocks. Remove DRCK clock from the list below if it is not defined.
# set_clock_groups -asynchronous -group {jtag_inst1_TCK jtag_inst1_DRCK}

# HSIO GPIO Constraints
#########################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {ARSTN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {ARSTN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {INTB_0}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {INTB_0}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {INTB_1}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {INTB_1}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {PHYRSTN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {PHYRSTN}]
create_clock -period <USER_PERIOD> [get_ports {RCLK_0}]
create_clock -period <USER_PERIOD> [get_ports {RCLK_1}]
set_input_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~244}] -max 0.414 [get_ports {RXDV_0 RXER_0}]
set_input_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~244}] -min 0.276 [get_ports {RXDV_0 RXER_0}]
set_input_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~571}] -max 0.414 [get_ports {RXDV_1 RXER_1}]
set_input_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~571}] -min 0.276 [get_ports {RXDV_1 RXER_1}]
set_input_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~278}] -max 0.414 [get_ports {RXD_0[0] RXD_0[4]}]
set_input_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~278}] -min 0.276 [get_ports {RXD_0[0] RXD_0[4]}]
set_input_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~277}] -max 0.414 [get_ports {RXD_0[1] RXD_0[5]}]
set_input_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~277}] -min 0.276 [get_ports {RXD_0[1] RXD_0[5]}]
set_input_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~255}] -max 0.414 [get_ports {RXD_0[2] RXD_0[6]}]
set_input_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~255}] -min 0.276 [get_ports {RXD_0[2] RXD_0[6]}]
set_input_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~254}] -max 0.414 [get_ports {RXD_0[3] RXD_0[7]}]
set_input_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~254}] -min 0.276 [get_ports {RXD_0[3] RXD_0[7]}]
set_input_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~560}] -max 0.414 [get_ports {RXD_1[0] RXD_1[4]}]
set_input_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~560}] -min 0.276 [get_ports {RXD_1[0] RXD_1[4]}]
set_input_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~559}] -max 0.414 [get_ports {RXD_1[1] RXD_1[5]}]
set_input_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~559}] -min 0.276 [get_ports {RXD_1[1] RXD_1[5]}]
set_input_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~548}] -max 0.414 [get_ports {RXD_1[2] RXD_1[6]}]
set_input_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~548}] -min 0.276 [get_ports {RXD_1[2] RXD_1[6]}]
set_input_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~547}] -max 0.414 [get_ports {RXD_1[3] RXD_1[7]}]
set_input_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~547}] -min 0.276 [get_ports {RXD_1[3] RXD_1[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {MDC_0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {MDC_0}]
set_output_delay -clock PLL_RCLK_0_90 -reference_pin [get_ports {PLL_RCLK_0_90~CLKOUT~333~336}] -max 0.263 [get_ports {TCLK_0_0 TCLK_1_0}]
set_output_delay -clock PLL_RCLK_0_90 -reference_pin [get_ports {PLL_RCLK_0_90~CLKOUT~333~336}] -min -0.140 [get_ports {TCLK_0_0 TCLK_1_0}]
set_output_delay -clock PLL_RCLK_1_90 -reference_pin [get_ports {PLL_RCLK_1_90~CLKOUT~333~420}] -max 0.263 [get_ports {TCLK_0_1 TCLK_1_1}]
set_output_delay -clock PLL_RCLK_1_90 -reference_pin [get_ports {PLL_RCLK_1_90~CLKOUT~333~420}] -min -0.140 [get_ports {TCLK_0_1 TCLK_1_1}]
set_output_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~304}] -max 0.263 [get_ports {TXEN_0 TXER_0}]
set_output_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~304}] -min -0.140 [get_ports {TXEN_0 TXER_0}]
set_output_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~359}] -max 0.263 [get_ports {TXEN_1 TXER_1}]
set_output_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~359}] -min -0.140 [get_ports {TXEN_1 TXER_1}]
set_output_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~202~642}] -max 0.263 [get_ports {TXD_0[0] TXD_0[4]}]
set_output_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~202~642}] -min -0.140 [get_ports {TXD_0[0] TXD_0[4]}]
set_output_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~201~642}] -max 0.263 [get_ports {TXD_0[1] TXD_0[5]}]
set_output_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~201~642}] -min -0.140 [get_ports {TXD_0[1] TXD_0[5]}]
set_output_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~294}] -max 0.263 [get_ports {TXD_0[2] TXD_0[6]}]
set_output_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~294}] -min -0.140 [get_ports {TXD_0[2] TXD_0[6]}]
set_output_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~293}] -max 0.263 [get_ports {TXD_0[3] TXD_0[7]}]
set_output_delay -clock PLL_RCLK_0 -reference_pin [get_ports {PLL_RCLK_0~CLKOUT~333~293}] -min -0.140 [get_ports {TXD_0[3] TXD_0[7]}]
set_output_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~385}] -max 0.263 [get_ports {TXD_1[0] TXD_1[4]}]
set_output_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~385}] -min -0.140 [get_ports {TXD_1[0] TXD_1[4]}]
set_output_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~384}] -max 0.263 [get_ports {TXD_1[1] TXD_1[5]}]
set_output_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~384}] -min -0.140 [get_ports {TXD_1[1] TXD_1[5]}]
set_output_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~349}] -max 0.263 [get_ports {TXD_1[2] TXD_1[6]}]
set_output_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~349}] -min -0.140 [get_ports {TXD_1[2] TXD_1[6]}]
set_output_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~348}] -max 0.263 [get_ports {TXD_1[3] TXD_1[7]}]
set_output_delay -clock PLL_RCLK_1 -reference_pin [get_ports {PLL_RCLK_1~CLKOUT~333~348}] -min -0.140 [get_ports {TXD_1[3] TXD_1[7]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {MDIOI_0}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {MDIOI_0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {MDIOO_0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {MDIOO_0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {MDIOE_0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {MDIOE_0}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {RSTN_0_IN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {RSTN_0_IN}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {RSTN_0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {RSTN_0}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {RSTN_1_IN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {RSTN_1_IN}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {RSTN_1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {RSTN_1}]

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {PLL_RCLK_0}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {PLL_RCLK_0}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {PLL_RCLK_0_90}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {PLL_RCLK_0_90}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {PLL_RCLK_1}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {PLL_RCLK_1}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {PLL_RCLK_1_90}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {PLL_RCLK_1_90}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {RCLK_0}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {RCLK_0}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {RCLK_1}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {RCLK_1}]
